<?php

return [
    'common' => [
        'name' => 'Όνομα',
        'email' => 'Email',
        'website' => 'Ιστοσελίδα',
        'comment' => 'Σχόλιο',
        'email_placeholder' => 'Η διεύθυνση email σας δεν θα δημοσιευθεί.',
        'website_placeholder' => 'π.χ. https://example.com',
    ],

    'title' => 'Σχόλια',
    'author' => 'Συγγραφέας',
    'responsed_to' => 'Απάντηση σε',
    'permalink' => 'Μόνιμος σύνδεσμος',
    'url' => 'URL',
    'submitted_on' => 'Υποβλήθηκε στις',
    'edit_comment' => 'Επεξεργασία σχολίου',
    'reply' => 'Απάντηση',
    'in_reply_to' => 'Σε απάντηση στον :name',

    'reply_modal' => [
        'title' => 'Απάντηση στο :comment',
        'cancel' => 'Ακύρωση',
    ],

    'allow_comments' => 'Επιτρέπονται σχόλια',

    'front' => [
        'admin_badge' => 'Διαχειριστής',

        'list' => [
            'title' => ':count σχόλιο|:count σχόλια',
            'reply' => 'Απάντηση',
            'reply_to' => 'Απάντηση στον :name',
            'cancel_reply' => 'Ακύρωση απάντησης',
            'waiting_for_approval_message' => 'Το σχόλιό σας αναμένει έγκριση. Αυτή είναι μια προεπισκόπηση, το σχόλιό σας θα είναι ορατό μετά την έγκριση.',
        ],

        'form' => [
            'title' => 'Αφήστε ένα σχόλιο',
            'description' => 'Η διεύθυνση email σας δεν θα δημοσιευθεί. Τα απαιτούμενα πεδία επισημαίνονται με *',
            'cookie_consent' => 'Αποθήκευση του ονόματος, email και ιστοσελίδας μου σε αυτόν τον φυλλομετρητή για την επόμενη φορά που θα σχολιάσω.',
            'submit' => 'Υποβολή σχολίου',
        ],

        'comment_success_message' => 'Το σχόλιό σας υποβλήθηκε επιτυχώς.',
    ],

    'enums' => [
        'statuses' => [
            'pending' => 'Εκκρεμεί',
            'approved' => 'Εγκρίθηκε',
            'spam' => 'Ανεπιθύμητα',
            'trash' => 'Κάδος',
        ],
    ],

    'settings' => [
        'title' => 'FOB Comment',
        'description' => 'Διαμόρφωση ρυθμίσεων για το FOB Comment',

        'form' => [
            'enable_recaptcha' => 'Ενεργοποίηση reCAPTCHA',
            'enable_recaptcha_help' => 'Πρέπει να ενεργοποιήσετε το reCAPTCHA στο :url για να χρησιμοποιήσετε αυτή τη λειτουργία.',
            'captcha_setting_label' => 'Ρυθμίσεις Captcha',
            'comment_moderation' => 'Τα σχόλια πρέπει να εγκριθούν χειροκίνητα',
            'comment_moderation_help' => 'Όλα τα σχόλια πρέπει να εγκριθούν χειροκίνητα από έναν διαχειριστή πριν εμφανιστούν στο frontend.',
            'show_comment_cookie_consent' => 'Εμφάνιση πλαισίου ελέγχου cookies σχολίων, επιτρέποντας στους επισκέπτες να αποθηκεύσουν τις πληροφορίες τους στον φυλλομετρητή',
            'auto_fill_comment_form' => 'Αυτόματη συμπλήρωση δεδομένων σχολίου για συνδεδεμένους χρήστες',
            'auto_fill_comment_form_help' => 'Η φόρμα σχολίου θα συμπληρωθεί αυτόματα με δεδομένα χρήστη όπως πλήρες όνομα, email κλπ., εάν είναι συνδεδεμένοι.',
            'comment_order' => 'Ταξινόμηση σχολίων κατά',
            'comment_order_help' => 'Επιλέξτε την προτιμώμενη σειρά για την εμφάνιση σχολίων στη λίστα.',
            'comment_order_choices' => [
                'asc' => 'Παλαιότερα',
                'desc' => 'Νεότερα',
            ],
            'display_admin_badge' => 'Εμφάνιση σήματος διαχειριστή για σχόλια διαχειριστών',
            'show_admin_role_name_for_admin_badge' => 'Εμφάνιση ονόματος ρόλου διαχειριστή για το σήμα διαχειριστή',
            'show_admin_role_name_for_admin_badge_helper' => 'Εάν ενεργοποιηθεί, το σήμα διαχειριστή θα εμφανίζει το όνομα ρόλου διαχειριστή αντί του προεπιλεγμένου κειμένου "Διαχειριστής". Εάν το όνομα ρόλου διαχειριστή είναι κενό, θα χρησιμοποιηθεί το προεπιλεγμένο κείμενο. Εάν ο χρήστης έχει πολλούς ρόλους, θα χρησιμοποιηθεί ο πρώτος ρόλος.',
            'default_avatar' => 'Προεπιλεγμένο avatar',
            'default_avatar_helper' => 'Προεπιλεγμένο avatar για τον συγγραφέα όταν δεν έχει avatar. Εάν δεν επιλέξετε καμία εικόνα, θα δημιουργηθεί χρησιμοποιώντας το Gravatar. Το μέγεθος εικόνας θα πρέπει να είναι 150x150px.',
        ],
    ],
];